app/views/games/show.html.erb

SELECT  "sides".* FROM "sides" WHERE "sides"."game_id" = $1 ORDER BY "sides"."id" ASC LIMIT $2  [["game_id", 1], ["LIMIT", 1]]
---

<% @game.sides.first.board.each do |row| %>