app/controllers/funs_controller.rb

SELECT  "funs".* FROM "funs" WHERE "funs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "funs" SET "player2_id" = $1, "updated_at" = $2 WHERE "funs"."id" = $3  [["player2_id", 3], ["updated_at", 2017-04-13 05:54:34 UTC], ["id", 9]]
---
  def show
    @fun = Fun.find(params[:id])
    @user = current_user
    if ((@fun.player2_id == nil) && (@fun.player2_id != @user.id))
      @fun.player2_id = @user.id
      @fun.save

INSERT INTO "funs" ("board1", "board2", "board1_display", "board2_display", "turn", "player1_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def new
    board = Array.new(10) { Array.new(10, 'grass') }
    @fun = Fun.new(board1: board, board2: board, board1_display: board, board2_display: board, player1: current_user)
    if @fun.save

SELECT  "funs".* FROM "funs" WHERE "funs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "funs" SET "board1_display" = $1, "updated_at" = $2 WHERE "funs"."id" = $3
---
  def update
    @fun = Fun.find(params[:id])
    if params[:size_ship]
      s_p = [params[:s_p_x].to_i, params[:s_p_y].to_i]

      if current_user.username == @fun.player1.username
        args = { 'size_ship' => params[:size_ship].to_i, 'direction' => params[:direction], 's_p' => s_p, 'board' => @fun.board1 }
      else
        args = { 'size_ship' => params[:size_ship].to_i, 'direction' => params[:direction], 's_p' => s_p, 'board' => @fun.board2 }
      end

      @fun.sheep_placer(args)
    else
      position = [params[:X].to_i, params[:Y].to_i]
      if current_user.username == @fun.player1.username
        @fun.sheep_shooter(position, @fun.board2_display)
      else
        @fun.sheep_shooter(position, @fun.board1_display)
      end
    end
    @fun.save