app/controllers/messages_controller.rb

  def create
    @game = current_user.games.last
    @message = Message.new(text: params[:message][:text], user: current_user, conversation: @game.conversation)

    if @message.save
---
SELECT  "games".* FROM "games" INNER JOIN "sides" ON "games"."id" = "sides"."game_id" WHERE "sides"."user_id" = $1 ORDER BY "games"."id" DESC LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
INSERT INTO "messages" ("text", "user_id", "conversation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "fdfdfd"], ["user_id", 1], ["conversation_id", 1], ["created_at", 2017-02-16 23:31:55 UTC], ["updated_at", 2017-02-16 23:31:55 UTC]]