app/controllers/static_controller.rb

SELECT "funs".* FROM "funs"
---
	def homepage
		@funs = Fun.all