app/controllers/static_controller.rb

SELECT  "sides".* FROM "sides" ORDER BY "sides"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
	def homepage
		@side = Side.first